Revit 2027 API
ColorFillSchemeEntry.GetStringValue Method
 Gets the String value stored within the entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetStringValue()
Public Function GetStringValue As String
public:
String^ GetStringValue()
member GetStringValue : unit -> string
Return Value
String
 The String contained in the entry.
Remarks
 This method should only be used if the StorageType property reports the type of the entry as a String.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace